Моя/src/Documents/ПокупкаКрипто/ПокупкаКрипто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаКрипто</name>
  <registerRecords>AccumulationRegister.ДвиженияКрипто</registerRecords>
  <attributes>
    <name>Криптовалюта</name>
    <type>
      <types>CatalogRef.Криптовалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКрипто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПокупки</name>
    <type>
      <types>CatalogRef.Криптовалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Моя/src/AccumulationRegisters/ДвиженияКрипто/ДвиженияКрипто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияКрипто</name>
  <resources>
    <name>КоличествоКрипто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Криптовалюта</name>
    <type>
      <types>CatalogRef.Криптовалюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаПокупки</name>
    <type>
      <types>CatalogRef.Криптовалюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Моя/src/Documents/ПокупкаКрипто/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДвиженияКрипто.Записывать = Истина;
	Движение = Движения.ДвиженияКрипто.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Криптовалюта = Криптовалюта;
	Движение.ВалютаПокупки = ВалютаПокупки;
	Движение.КоличествоКрипто = КоличествоКрипто;
	Движение.КоличествоВалюты = КоличествоВалюты;
КонецПроцедуры
